testing/results/canvas-20260420-144957/k6-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/ubuntu/canvas-k8s/testing/load_test/canvas-load.js
        output: Prometheus remote write (http://127.0.0.1:30090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

running (00m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m00.8s/10m0s  0/1 iters, 1 per VU


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<3000' p(95)=322.07ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 18      4.806754/s
    checks_succeeded...: 100.00% 18 out of 18
    checks_failed......: 0.00%   0 out of 18

    ✓ /api/v1/accounts/self/courses status is 200
    ✓ /api/v1/courses/15/assignments status is 200
    ✓ /api/v1/courses/15/quizzes status is 200
    ✓ /api/v1/courses/16/assignments status is 200
    ✓ /api/v1/courses/16/quizzes status is 200
    ✓ /api/v1/courses/17/assignments status is 200
    ✓ /api/v1/courses/17/quizzes status is 200
    ✓ /api/v1/courses/18/assignments status is 200
    ✓ /api/v1/courses/18/quizzes status is 200
    ✓ /api/v1/courses/19/assignments status is 200
    ✓ /api/v1/courses/19/quizzes status is 200
    ✓ /api/v1/courses/20/assignments status is 200
    ✓ /api/v1/courses/20/quizzes status is 200
    ✓ /api/v1/courses/21/assignments status is 200
    ✓ /api/v1/courses/21/quizzes status is 200
    ✓ /api/v1/courses/22/assignments status is 200
    ✓ /api/v1/courses/22/quizzes status is 200
    ✓ modules status is 200

    HTTP
    http_req_duration..............: avg=122.06ms min=25.99ms med=118.87ms max=357.32ms p(90)=285.2ms p(95)=322.07ms
      { expected_response:true }...: avg=122.06ms min=25.99ms med=118.87ms max=357.32ms p(90)=285.2ms p(95)=322.07ms
    http_req_failed................: 0.00%  0 out of 18
    http_reqs......................: 18     4.806754/s

    EXECUTION
    iteration_duration.............: avg=1.58s    min=1.58s   med=1.58s    max=1.58s    p(90)=1.58s   p(95)=1.58s   
    iterations.....................: 1      0.267042/s
    vus............................: 1      min=0       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 288 kB 77 kB/s
    data_sent......................: 10 kB  2.7 kB/s



running (00m03.7s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m01.6s/10m0s  1/1 iters, 1 per VU